index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Tim McIver)"/>
<link rel="stylesheet" href="file:///Users/timmciver/Workspace/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="file:///Users/timmciver/Workspace/reveal.js/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2 class="author">Tim McIver</h2><p class="date">Created: 2017-09-01 Fri 20:39</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgba8ef8c">The Problem Statement</a></li>
<li><a href="#/slide-org7d178f6">An Example</a></li>
<li><a href="#/slide-orge199f92">Review of Some Fundamentals</a></li>
<li><a href="#/slide-org22db9ea">Simulating ADTs in OO</a></li>
<li><a href="#/slide-org20c9514">The Visitor Pattern to the Rescue!</a></li>
</ul>
</div>
</div>
</section>



<section>
<section id="slide-orgba8ef8c">
<h2 id="orgba8ef8c">The Problem Statement</h2>
<div class="outline-text-2" id="text-orgba8ef8c">
</div></section>
<section id="slide-org427cb58">
<h3 id="org427cb58">Can we attain the same level of generalized dispatch on values of a type using an Object-Oriented language that our friends using functional languages enjoy?</h3>
<p class="fragment appear">
Answer: Yes!
</p>
<p class="fragment appear">
Well, almost.
</p>


</section>
</section>
<section>
<section id="slide-org7d178f6">
<h2 id="org7d178f6">An Example</h2>
<div class="outline-text-2" id="text-org7d178f6">
</div></section>
<section id="slide-org5f61c14">
<h3 id="org5f61c14">Dispatching on Values in Scala</h3>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #e090d7;">sealed</span> <span style="color: #b4fa70;">trait</span> <span style="color: #8cc4ff;">Pet</span>

<span style="color: #b4fa70;">object</span> <span style="color: #e9b2e3;">Pet</span> {

  <span style="color: #b4fa70;">case</span> <span style="color: #b4fa70;">object</span> <span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Dog</span> <span style="color: #b4fa70;">extends</span> <span style="color: #8cc4ff;">Pet</span>
  <span style="color: #b4fa70;">case</span> <span style="color: #b4fa70;">object</span> <span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Cat</span> <span style="color: #b4fa70;">extends</span> <span style="color: #8cc4ff;">Pet</span>
  <span style="color: #b4fa70;">case</span> <span style="color: #b4fa70;">object</span> <span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Goldfish</span> <span style="color: #b4fa70;">extends</span> <span style="color: #8cc4ff;">Pet</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">hasFur</span>(pet<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Pet</span>) <span style="color: #b4fa70;">=</span> pet <span style="color: #b4fa70;">match</span> {
    <span style="color: #b4fa70;">case</span> <span style="color: #e9b2e3;">Dog</span> <span style="color: #b4fa70;">=&gt;</span> <span style="color: #e9b2e3;">true</span>
    <span style="color: #b4fa70;">case</span> <span style="color: #e9b2e3;">Cat</span> <span style="color: #b4fa70;">=&gt;</span> <span style="color: #e9b2e3;">true</span>
    <span style="color: #b4fa70;">case</span> <span style="color: #e9b2e3;">Goldfish</span> <span style="color: #b4fa70;">=&gt;</span> <span style="color: #e9b2e3;">false</span>
  }
}
</pre>
</div>

</section>
<section id="slide-org0f37d6e">
<h3 id="org0f37d6e">Dispatching on Values in PHP</h3>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">interface</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>();
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Dog</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>() { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>; }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Cat</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>() { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>; }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Goldfish</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>() { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">false</span>; }
}

<span style="color: #73d216;">// </span><span style="color: #73d216;">caller doesn't necessarily know the runtime</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">type of $myPet - and shouldn't care.</span>
$<span style="color: #fcaf3e;">myPet</span>-&gt;<span style="color: #eeeeec; background-color: #2e3436;">hasFur</span>();
</pre>
</div>

</section>
<section id="slide-org47e1a03">
<h3 id="org47e1a03">Use in a Pet Store Application (Scala)</h3>
<p>
A part of the application needs to know what pets a given pet might attack.
</p>

<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #b4fa70;">object</span> <span style="color: #e9b2e3;">PetStore</span> {

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">mayAttack</span>(pet<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Pet</span>)<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Seq</span>[<span style="color: #e9b2e3;">Pet</span>] <span style="color: #b4fa70;">=</span> pet <span style="color: #b4fa70;">match</span> {
    <span style="color: #b4fa70;">case</span> <span style="color: #e9b2e3;">Dog</span> <span style="color: #b4fa70;">=&gt;</span> <span style="color: #e9b2e3;">List</span>(<span style="color: #e9b2e3;">Cat</span>)
    <span style="color: #b4fa70;">case</span> <span style="color: #e9b2e3;">Cat</span> <span style="color: #b4fa70;">=&gt;</span> <span style="color: #e9b2e3;">List</span>(<span style="color: #e9b2e3;">Dog</span>, <span style="color: #e9b2e3;">Goldfish</span>)
    <span style="color: #b4fa70;">case</span> <span style="color: #e9b2e3;">Goldfish</span> <span style="color: #b4fa70;">=&gt;</span> <span style="color: #e9b2e3;">List</span>()
  }
}
</pre>
</div>

</section>
<section id="slide-org9ae2f0f">
<h3 id="org9ae2f0f">Use in a Pet Store Application (PHP)</h3>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">interface</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>();
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">mayAttack</span>();
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Dog</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>() { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>; }
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">mayAttack</span>() { <span style="color: #b4fa70;">return</span> [<span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">Cat</span>()]; }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Cat</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>() { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>; }
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">mayAttack</span>() { <span style="color: #b4fa70;">return</span> [<span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">Dog</span>(), <span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">Goldfish</span>()]; }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Goldfish</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">hasFur</span>() { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">false</span>; }
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">mayAttack</span>() { <span style="color: #b4fa70;">return</span> []; }
}
</pre>
</div>

</section>
<section id="slide-org99d735a">
<h3 id="org99d735a">But if you could, should you?</h3>
<p>
Doing this in an OO language has several drawbacks:
</p>
<ul>
<li class="fragment appear">Requires you to modify the existing classes</li>
<li class="fragment appear">Adds bloat to those classes</li>
<li class="fragment appear">Places logic far from the module in which it is used</li>

</ul>

</section>
<section id="slide-org2a575a2">
<h3 id="org2a575a2">Sometimes you can't, even if you want to</h3>
<p>
If you don't control the classes you wish to dispatch on, you have to resort to using <code>instanceof</code>:
</p>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">PetStore</span> {

  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">mayAttack</span>($<span style="color: #fcaf3e;">pet</span>) {
    $<span style="color: #fcaf3e;">mayAttack</span> = [];
    <span style="color: #b4fa70;">if</span> ($<span style="color: #fcaf3e;">pet</span> <span style="color: #b4fa70;">instanceof</span> <span style="color: #ff4b4b;">Dog</span>) {
      $<span style="color: #fcaf3e;">mayAttack</span> = [<span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">Cat</span>()];
    } <span style="color: #b4fa70;">else</span> <span style="color: #b4fa70;">if</span> ($<span style="color: #fcaf3e;">pet</span> <span style="color: #b4fa70;">instanceof</span> <span style="color: #ff4b4b;">Cat</span>) {
      $<span style="color: #fcaf3e;">mayAttack</span> = [<span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">Dog</span>(), <span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">Goldfish</span>()];
    }

    <span style="color: #b4fa70;">return</span> $<span style="color: #fcaf3e;">mayAttack</span>;
  }
}
</pre>
</div>

</section>
<section id="slide-org8e7cc66">
<h3 id="org8e7cc66">A Solution</h3>
<p>
What if <code>Pet</code> looked like the following?
</p>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">interface</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">functionMap</span>);
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Dog</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">functionMap</span>) {
    <span style="color: #b4fa70;">return</span> <span style="color: #eeeeec; background-color: #2e3436;">call_user_func(</span>$<span style="color: #fcaf3e;">functionMap</span>[<span style="color: #e9b96e;">'Dog'</span>], [$<span style="color: #e9b2e3;">this</span>]);
  }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Cat</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">functionMap</span>) {
    <span style="color: #b4fa70;">return</span> <span style="color: #eeeeec; background-color: #2e3436;">call_user_func(</span>$<span style="color: #fcaf3e;">functionMap</span>[<span style="color: #e9b96e;">'Cat'</span>], [$<span style="color: #e9b2e3;">this</span>]);
  }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Goldfish</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">functionMap</span>) {
    <span style="color: #b4fa70;">return</span> <span style="color: #eeeeec; background-color: #2e3436;">call_user_func(</span>$<span style="color: #fcaf3e;">functionMap</span>[<span style="color: #e9b96e;">'Goldfish'</span>], [$<span style="color: #e9b2e3;">this</span>]);
  }
}
</pre>
</div>

</section>
<section id="slide-orgd108605">
<h3 id="orgd108605">A Solution (Continued)</h3>
<p>
Define and Use a Function Map
</p>
<div class="org-src-container">

<pre  class="src src-php">$<span style="color: #fcaf3e;">hasFurFunctionMap</span> = [
  <span style="color: #e9b96e;">'Dog'</span> =&gt; <span style="color: #eeeeec; background-color: #2e3436;">function(</span>$<span style="color: #fcaf3e;">dog</span>) {
             <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>;
           }
  <span style="color: #e9b96e;">'Cat'</span> =&gt; <span style="color: #eeeeec; background-color: #2e3436;">function(</span>$<span style="color: #fcaf3e;">dog</span>) {
             <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>;
           }
  <span style="color: #e9b96e;">'Goldfish'</span> =&gt; <span style="color: #eeeeec; background-color: #2e3436;">function(</span>$<span style="color: #fcaf3e;">dog</span>) {
                  <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">false</span>;
                }
];

$<span style="color: #fcaf3e;">hasFur</span> = $<span style="color: #fcaf3e;">pet</span>-&gt;<span style="color: #eeeeec; background-color: #2e3436;">callYourFunction</span>($<span style="color: #fcaf3e;">hasFurFunctionMap</span>);
</pre>
</div>

</section>
<section id="slide-org4306a1c">
<h3 id="org4306a1c">Another Solution</h3>
<p>
Instead of a map, let's use an interface
</p>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">interface</span> <span style="color: #8cc4ff;">PetFunctions</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">functionForDog</span>($<span style="color: #fcaf3e;">dog</span>);
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">functionForCat</span>($<span style="color: #fcaf3e;">cat</span>);
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">functionForGoldfish</span>($<span style="color: #fcaf3e;">goldfish</span>);
}
</pre>
</div>

<p class="fragment appear">
And implement that interface:
</p>
<div class="org-src-container">

<pre  class="fragment appear"><span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">HasFurFunctions</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">PetFunctions</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">functionForDog</span>($<span style="color: #fcaf3e;">dog</span>) { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>; }
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">functionForCat</span>($<span style="color: #fcaf3e;">cat</span>) { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">true</span>; }
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">functionForGoldfish</span>($<span style="color: #fcaf3e;">goldfish</span>) { <span style="color: #b4fa70;">return</span> <span style="color: #e9b2e3;">false</span>; }
}
</pre>
</div>

</section>
<section id="slide-orged2a5d2">
<h3 id="orged2a5d2">Another Solution (Continued)</h3>
<p>
And change <code>Pet</code> to the following:
</p>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">interface</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">petFunctions</span>);
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Dog</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">petFunctions</span>) {
    <span style="color: #b4fa70;">return</span> $<span style="color: #fcaf3e;">petFunctions</span>-&gt;<span style="color: #eeeeec; background-color: #2e3436;">functionForDog</span>($<span style="color: #e9b2e3;">this</span>);
  }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Cat</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">petFunctions</span>) {
    <span style="color: #b4fa70;">return</span> $<span style="color: #fcaf3e;">petFunctions</span>-&gt;<span style="color: #eeeeec; background-color: #2e3436;">functionForCat</span>($<span style="color: #e9b2e3;">this</span>);
  }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Goldfish</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Pet</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">callYourFunction</span>($<span style="color: #fcaf3e;">petFunctions</span>) {
    <span style="color: #b4fa70;">return</span> $<span style="color: #fcaf3e;">petFunctions</span>-&gt;<span style="color: #eeeeec; background-color: #2e3436;">functionForGoldfish</span>($<span style="color: #e9b2e3;">this</span>);
  }
}
</pre>
</div>

</section>
<section id="slide-orge68d6f3">
<h3 id="orge68d6f3">Another Solution (Continued)</h3>
<p>
Finally, use the <code>HasFur</code> <code>PetFunctions</code>:
</p>
<div class="org-src-container">

<pre  class="src src-php">$<span style="color: #fcaf3e;">hasFur</span> = $<span style="color: #fcaf3e;">pet</span>-&gt;<span style="color: #eeeeec; background-color: #2e3436;">callYourFunction</span>(<span style="color: #b4fa70;">new</span> <span style="color: #8cc4ff;">HasFurFunctions</span>());
</pre>
</div>


</section>
</section>
<section>
<section id="slide-orge199f92">
<h2 id="orge199f92">Review of Some Fundamentals</h2>
<div class="outline-text-2" id="text-orge199f92">
</div></section>
<section id="slide-org7ef9f8c">
<h3 id="org7ef9f8c">What is a type?</h3>
<p>
A type is simply a set of values.
</p>

<p>
For example:
</p>
<ul>
<li>booleans can have a value of "true" or "false"</li>
<li>integers can be any integer, usually within some range.</li>

</ul>

</section>
<section id="slide-org0f2760a">
<h3 id="org0f2760a">Dynamic Dispatch</h3>

</section>
<section id="slide-org76ee481">
<h3 id="org76ee481">Algebraic Data Types</h3>


</section>
</section>
<section>
<section id="slide-org22db9ea">
<h2 id="org22db9ea">Simulating ADTs in OO</h2>
<div class="outline-text-2" id="text-org22db9ea">
</div></section>
<section id="slide-org00a8979">
<h3 id="org00a8979">Can We Have Algebraic Data Types in an OO Language? Yes!</h3>



</section>
</section>
<section>
<section id="slide-org20c9514">
<h2 id="org20c9514">The Visitor Pattern to the Rescue!</h2>
</section>
</section>
</div>
</div>
<script src="file:///Users/timmciver/Workspace/reveal.js/lib/js/head.min.js"></script>
<script src="file:///Users/timmciver/Workspace/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'file:///Users/timmciver/Workspace/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'file:///Users/timmciver/Workspace/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///Users/timmciver/Workspace/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///Users/timmciver/Workspace/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'file:///Users/timmciver/Workspace/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
